In [1]:
import pandas as pd

In [24]:
a = [4,5,6,7.8]

In [25]:
b = [i*2 for i in a]

In [26]:
b

[8, 10, 12, 15.6]

In [28]:
# the column name
cols = ['user_id','movie_id','rating','ts']

In [27]:
# read the file
df = pd.read_csv('u.data', sep='\t', names=cols)

In [33]:
df1 = pd.read_csv('u.item', sep='|', names = item_cols, encoding = "ISO-8859-1")[['movie_id',"title"]]

In [11]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [12]:
df.sample(5)

       user_id  movie_id  rating         ts
46331      357       473       3  878951831
61480      791       300       5  879447977
65148      466        50       5  890284819
55887      766       230       3  891310444
12563      157      1283       2  886891173

In [22]:
df1.head()

,1,Toy Story (1995),01-Jan-1995,Unnamed: 3,http://us.imdb.com/M/title-exact?Toy%20Story%20(1995),0,0.1,0.2,1.1,1.2,...,0.6,0.7,0.8,0.9,0.10,0.11,0.12,0.13,0.14,0.15
0,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
1,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,6,Shanghai Triad (Yao a yao yao dao waipo qiao) ...,01-Jan-1995,NaN,http://us.imdb.com/Title?Yao+a+yao+yao+dao+wai...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [15]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [17]:
# try to find the different data 
#1. strings with categorical info 
#2. strings with random stuff
#3. number with qunitified info
#4. number with categorial info

In [18]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [19]:
df['rating'].nunique()

5

In [23]:
df1.shape

(1681, 24)

In [29]:
item_cols = ['movie_id','title'] + [str(i) for i in range(22)]

In [30]:
item_cols = ['movie_id','title'] + list(range(22))

In [34]:
df1.sample(3)

      movie_id                        title
1563      1564  To Cross the Rubicon (1991)
521        522           Down by Law (1986)
1639      1640       Eighth Day, The (1996)

In [35]:
# merging the dataframes

In [7]:
movie = pd.merge(df,df1, on='movie_id')
movie.head()

NameError: name 'df' is not defined

In [38]:
# remove the redundant or useless columns i.e. ts
movie.drop('ts', axis=1, inplace=True)

In [40]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [45]:
# find the number of rating for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [48]:
# find the average rating for each movies
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64

In [5]:
import pandas as pd

In [10]:
movie_pivot = movie.pivot_table(index = 'user_id', columns = 'title', values = 'rating')
movie_pivot.head()

NameError: name 'movie' is not defined